Revit 2027 API
ParameterUtils Methods
The ParameterUtils type exposes the following members.
Methods
Name | Description
DownloadCompanyName(Document, ForgeTypeId) | Obsolete.
 Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
DownloadCompanyName(Document, ForgeTypeId, String) |  Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
DownloadParameter(Document, ParameterDownloadOptions, ForgeTypeId) | Obsolete.
 Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service.
DownloadParameter(Document, ParameterDownloadOptions, ForgeTypeId, String) |  Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service.
DownloadParameterOptions(ForgeTypeId) | Obsolete.
 Retrieves settings associated with the given parameter from the Parameters Service.
DownloadParameterOptions(ForgeTypeId, String) |  Retrieves settings associated with the given parameter from the Parameters Service.
GetAllBuiltInGroups |  Gets the identifiers of all built-in parameter groups.
GetAllBuiltInParameters |  Gets the identifiers of all built-in parameters.
GetBuiltInParameter |  Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId.
GetBuiltInParameterGroupTypeId |  The parameter group identifier corresponding to the given built-in parameter identifier.
GetDefinition |  Gets the parameter definition for a built-in Revit parameter.
GetParameterTypeId |  Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
IsBuiltInGroup |  Checks whether a ForgeTypeId identifies a built-in parameter group.
IsBuiltInParameter(ElementId) |  Checks whether an ElementId identifies a built-in parameter.
IsBuiltInParameter(ForgeTypeId) |  Checks whether a ForgeTypeId identifies a built-in parameter.
IsValidRegionCode |  Checks whether a given region code is allowed to identify a region where an account containing parameter definitions may exist.
WriteSharedParametersToFile |  Generates a shared parameters text file from the shared parameters in a given document.
Top
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace